import { IsEmail, IsString } from 'class-validator';
import { ApiProperty } from '@nestjs/swagger';

export class UserDto {
  @ApiProperty({ example: 'user@gmail.com', description: 'Пошта' })
  @IsEmail({}, { message: 'Не корректний email' })
  readonly email: string;

  @ApiProperty({ example: '12345', description: 'пароль' })
  @IsString({ message: 'Повинен бути рядком' })
  readonly password: string;
}

// const passwordNew =
//   /(?=.*[0-9])(?=.*[!@#$%^&*])(?=.*[a-z])(?=.*[A-Z])[0-9a-zA-Z!@#$%^&*]{6,}/g;

// (?=.*[0-9]) - строка содержит хотя бы одно число;
// (?=.*[!@#$%^&*]) - строка содержит хотя бы один спецсимвол;
// (?=.*[a-z]) - строка содержит хотя бы одну латинскую букву в нижнем регистре;
// (?=.*[A-Z]) - строка содержит хотя бы одну латинскую букву в верхнем регистре;
// [0-9a-zA-Z!@#$%^&*]{6,} - строка состоит не менее, чем из 6 вышеупомянутых символов.

// @Matches(
//     /(?=.*[0-9])(?=.*[!@#$%^&*])(?=.*[a-z])(?=.*[A-Z])[0-9a-zA-Z!@#$%^&*]{6,}/g,
//     {
//       message:
//         'Пароль повинен: 1. Хотяби одне число; 2. Рядок повиене мати хотяби 1 спецсимвол; 3. Пароль повинен мати хотяби одну велику і маленьку літеру; 4. Мінімальна довжина 6 символів',
//     },
//   )
